postman/Marcos_W_Souza_API_Correios_Collections.postman_collection.json

{
	"info": {
		"_postman_id": "8cd65fed-69b6-4655-8c1e-9dec48d66e24",
		"name": "Marcos_W_Souza_API_Correios_Collections",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json"
	},
	"item": [
		{
			"name": "ConsultaCep",
			"item": [
				{
					"name": "consultaCEP",
					"event": [
						{
							"listen": "prerequest",
							"script": {
								"exec": [
									"pm.sendRequest({\r",
									"    'url': 'https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente',\r",
									"    'method': 'POST',\r",
									"    'header': 'Content-Type:application/xml',\r",
									"    'body': '<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:cli=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\"><soapenv:Header/><soapenv:Body><cli:consultaCEP><cep>01001000</cep></cli:consultaCEP></soapenv:Body></soapenv:Envelope>'\r",
									"},\r",
									"function (erro, response) { },);"
								],
								"type": "text/javascript"
							}
						},
						{
							"listen": "test",
							"script": {
								"exec": [
									""
								],
								"type": "text/javascript"
							}
						}
					],
					"request": {
						"method": "POST",
						"header": [],
						"body": {
							"mode": "raw",
							"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:cli=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <cli:consultaCEP>\r\n         <cep>{{CEP}}</cep>\r\n      </cli:consultaCEP>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente",
							"protocol": "https",
							"host": [
								"apps",
								"correios",
								"com",
								"br"
							],
							"path": [
								"SigepMasterJPA",
								"AtendeClienteService",
								"AtendeCliente"
							]
						}
					},
					"response": []
				}
			]
		}
	]
}